[
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in JavaScript, Node.js, PyTorch, Java, Python and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, Kubernetes, Agile, Docker, C++, React, SQL and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, C++, C#, Teamwork and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Problem Solving, C++, Teamwork, Kubernetes, AWS, Docker, Azure and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Angular, Teamwork, SQL, Azure and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Python, AWS, Azure, React, C#, C++, Communication and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in TensorFlow, React, JavaScript, Agile, Kubernetes, Python, Leadership and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, Teamwork, Angular, AWS, SQL, PyTorch, Python and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in AWS, TensorFlow and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Kubernetes, Leadership and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Kubernetes, Communication, AWS, Agile, Docker, Java and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C#, Leadership, React, Problem Solving, TensorFlow and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in PyTorch, AWS, SQL and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, AWS, TensorFlow, Leadership and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in TensorFlow, Node.js and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in PyTorch, AWS, Node.js, Problem Solving, C++, Teamwork and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, Problem Solving, C#, React, Agile, TensorFlow and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Teamwork, Java, Azure and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in React, Node.js, AWS, Java, Agile, Leadership and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, Problem Solving, Leadership, AWS, C++, Azure and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Docker, AWS and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in TensorFlow, Agile, AWS, Python, Teamwork and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in SQL, Docker, Agile, Teamwork, C++ and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in React, Communication, Docker, C#, Java, Agile and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Agile, SQL, AWS, PyTorch, Python and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Kubernetes, Agile, Teamwork, Python and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Docker, Communication, Teamwork and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Problem Solving, SQL, Java, PyTorch, Python and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in PyTorch, Teamwork, C#, Azure, Leadership, React, Python and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in SQL, Kubernetes and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, Leadership, PyTorch and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, AWS and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Leadership, Node.js, Agile, SQL, AWS and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in PyTorch, JavaScript, React, TensorFlow, Communication and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Azure, JavaScript, Node.js and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Problem Solving, Python, Leadership, Angular, React, Azure and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Docker, Problem Solving, Leadership, PyTorch, Java and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in React, Azure, SQL, Teamwork and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in PyTorch, Java and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Azure, Docker, Node.js, Java, Kubernetes, SQL and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Docker, Angular, SQL, Teamwork, Problem Solving, Python, React and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Agile, Python, React, Java, C++ and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in JavaScript, TensorFlow, Python, Azure, Angular and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in React, Teamwork, AWS, Azure and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in AWS, SQL and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Docker, Node.js, Communication and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Problem Solving, Node.js, TensorFlow and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, Problem Solving, Leadership, Kubernetes, Python and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in AWS, C#, Kubernetes, Docker, Agile, Python, React and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Node.js, Java, Problem Solving, TensorFlow, Communication and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, TensorFlow, Node.js and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Docker, SQL, Java, Agile, Angular and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Kubernetes, Docker, JavaScript, PyTorch, TensorFlow and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Python and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in SQL, Java, Node.js, React, JavaScript and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Node.js, AWS, Python, Java and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Java, AWS, SQL, Communication, Node.js, Docker and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in TensorFlow, Docker, React, Java, Communication, Azure and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, PyTorch, Angular, TensorFlow and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Problem Solving, Docker, TensorFlow and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in C++, React and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Angular, Problem Solving, Node.js, JavaScript, Teamwork, Kubernetes, C++ and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, Docker, Teamwork, Communication and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Teamwork, Angular, TensorFlow, PyTorch, Agile, C# and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Python, Teamwork, Angular, C++, React, Node.js and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in TensorFlow, Docker, Communication and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in C++, Azure, Docker, Leadership, Node.js and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Teamwork, JavaScript, Python, Kubernetes, C#, Azure, AWS and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in AWS, Java, Azure and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in JavaScript, SQL, TensorFlow, Docker, Kubernetes, Leadership, C# and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in React, C++, Node.js, SQL and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Kubernetes, Communication, Java, Teamwork and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, AWS and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Angular, PyTorch and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, Docker, Java and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in React, Leadership, SQL, Python and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, Angular, Azure, Docker, Teamwork, React, Node.js and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Angular, Leadership, C++, React, Communication and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in SQL, C++, Leadership and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Leadership, Communication and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:38:22.723421"
  }
]