[
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Azure, Python, PyTorch and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Docker, Java, Communication, SQL, JavaScript, Python and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Python, Java, Leadership, TensorFlow, Angular, AWS, Communication and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Azure, SQL, Python, Node.js and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in TensorFlow, Kubernetes, Leadership, Teamwork, AWS and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in PyTorch, Communication and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, C++, C# and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Python, Agile, AWS, Azure and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in JavaScript, Angular, Kubernetes, Problem Solving and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in JavaScript, Teamwork, Angular and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Communication, Python, C#, Docker and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C#, Docker, TensorFlow, AWS, JavaScript, Angular, Azure and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Agile, Leadership, React, Docker, C#, TensorFlow and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in TensorFlow, Leadership, C#, React, Teamwork, PyTorch and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C#, TensorFlow and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, C#, Teamwork, AWS, TensorFlow, Java, React and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, Teamwork, Python, Docker and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Python, Docker and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Communication, Problem Solving, SQL, Angular and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Communication, Java, Agile, PyTorch, Azure, Kubernetes and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in SQL, Docker, C#, JavaScript, Python and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Azure, React, Python, JavaScript, Java and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in TensorFlow, Kubernetes, Node.js and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Leadership, Azure, Teamwork, SQL and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Java, Teamwork, Node.js, Communication and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in TensorFlow, Azure and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in SQL, Docker, Teamwork, Agile, Problem Solving and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Problem Solving, Communication, Kubernetes, SQL, PyTorch, Leadership, Python and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in JavaScript, C++, Python, AWS, C#, React, Azure and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Agile, Node.js, Docker, SQL and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Java, Leadership, JavaScript and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Communication, Angular, Java, React, Kubernetes, Docker and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, Python, PyTorch, JavaScript, Communication, Agile, Leadership and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C#, Angular, Agile, Java, Communication, Node.js, Kubernetes and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Python, Angular, TensorFlow and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in PyTorch, C++ and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Problem Solving, Node.js and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Kubernetes, Leadership, SQL, TensorFlow, Python, AWS and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Teamwork, Problem Solving, SQL, C#, Communication, Leadership and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in JavaScript, Azure, Node.js and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C#, Problem Solving, C++, PyTorch, AWS, Kubernetes, Leadership and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Angular, PyTorch, React and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in React, SQL, PyTorch, Problem Solving, JavaScript, Python, Node.js and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Java, AWS, React and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Angular, AWS, Azure, Problem Solving, C#, JavaScript and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, SQL and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Docker, JavaScript, React, Communication, AWS and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Agile, Java, Leadership and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Communication, SQL, Python, TensorFlow and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Python, C#, Leadership, Kubernetes, TensorFlow and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in JavaScript, Communication, React, SQL, TensorFlow, Docker, AWS and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in SQL, Teamwork, React and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Node.js, C#, Agile, Teamwork and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Angular, AWS, Agile, Node.js, Leadership and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Azure, AWS, TensorFlow, Problem Solving, Python, JavaScript, C++ and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, Docker, React, TensorFlow, Communication and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Azure, Agile, Angular, PyTorch, C#, C++, Problem Solving and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Problem Solving, TensorFlow, Azure, JavaScript and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Python, AWS, Communication and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884385"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C#, Agile, Teamwork, SQL, Python and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Leadership, Teamwork and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, Problem Solving, Docker, C#, C++, Kubernetes and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Node.js, Teamwork, Problem Solving, PyTorch, React and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Agile, Python, C# and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Node.js, Problem Solving, Teamwork, Communication, Python, Azure, TensorFlow and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Leadership, Agile, TensorFlow, Kubernetes, SQL, Node.js and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in TensorFlow, Java, Kubernetes and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in SQL, C# and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, Leadership and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Python, Teamwork, Problem Solving, AWS, Angular and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Python, Communication, Problem Solving, Java, C# and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in C#, C++, JavaScript, Python, Kubernetes and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in React, SQL, Kubernetes and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in AWS, Communication, PyTorch and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, Azure and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, C++, JavaScript and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Kubernetes, Node.js, Python, Angular, Agile, React and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, Java and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, Leadership, Angular, Communication, Node.js, C#, Python and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, Angular and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T09:14:23.884889"
  }
]