[
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in PyTorch, Teamwork and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, Python, JavaScript, C++, React, Agile and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C#, TensorFlow, Angular, Communication, C++, Java, PyTorch and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Azure, Python, Teamwork, SQL and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Problem Solving, C# and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Kubernetes, Java, Communication, AWS, Leadership, Angular and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Teamwork, TensorFlow, Python, AWS, SQL and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Kubernetes, Communication, Angular, JavaScript, Node.js, Java, Docker and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Communication, C++, Kubernetes and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Leadership, React, Problem Solving, Azure and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, Java, React and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Communication, Agile, Node.js, TensorFlow, C++, Leadership and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in PyTorch, C#, Problem Solving, Azure and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Teamwork, Angular, Kubernetes, Python and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C#, Communication, C++ and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Communication, JavaScript, Problem Solving and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Agile, Problem Solving, Communication, Java, Angular, Azure, Node.js and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, Problem Solving, Python, Agile, C#, Teamwork and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Python, Leadership, C++, JavaScript and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, PyTorch and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C#, Azure, Docker, Problem Solving, Angular and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Communication, Node.js, SQL, Teamwork, Python, Problem Solving, TensorFlow and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Problem Solving, React, Communication and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Agile, C#, React, JavaScript, Communication and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in JavaScript, React, Docker, Java, Node.js and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in SQL, C++, Azure, Python and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in TensorFlow, Problem Solving, Docker, Leadership and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Java, Communication, C++, Leadership, Azure, PyTorch, Docker and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C#, Communication and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Problem Solving, Docker, AWS, Azure, Node.js, Leadership and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in React, Leadership, Node.js and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Kubernetes, TensorFlow, Communication, PyTorch and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Docker, Communication, Kubernetes and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Docker, AWS, Problem Solving and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in AWS, React, TensorFlow and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Kubernetes, React, C++, SQL, C#, Azure, JavaScript and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Docker, Kubernetes, Node.js and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Communication, JavaScript, Python and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in PyTorch, Kubernetes and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Azure, Python, C#, Java, Docker, TensorFlow and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Leadership, PyTorch, Angular, C#, Agile and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in JavaScript, React, Java, TensorFlow and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Angular, PyTorch, Leadership, TensorFlow, Azure, Kubernetes, Docker and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Communication, AWS, C++, TensorFlow, PyTorch, JavaScript and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Kubernetes, C# and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, Docker, Kubernetes, React, PyTorch, Teamwork, SQL and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, React, Node.js and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in JavaScript, Communication, C#, PyTorch, Angular, Problem Solving, Node.js and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in React, Java, Python, AWS and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C#, Teamwork, Communication, C++, Agile, Angular and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Java, SQL, Kubernetes and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Kubernetes, Communication and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Docker, Angular, React, Agile, C++, Problem Solving, Kubernetes and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Angular, Docker, AWS, Teamwork and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in JavaScript, Communication, AWS, SQL, Docker, C#, Angular and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Python, Kubernetes, C#, JavaScript, Leadership and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Java, Docker, Problem Solving, C#, Agile and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in SQL, Azure, Communication, C++, C# and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Azure, React, AWS, Node.js, Leadership and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Azure, Java, C# and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in TensorFlow, Node.js, Java, C#, Angular, React, Azure and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in React, Agile, PyTorch and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Java, C++, SQL and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in TensorFlow, Agile, Kubernetes and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Kubernetes, Agile, TensorFlow and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in JavaScript, C++, C#, Teamwork, Azure, Python and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, Leadership, C# and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Kubernetes, Teamwork, C++ and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, SQL, Angular and Node.js. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Azure, Leadership and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Node.js, C#, Agile, Angular, Docker and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, Problem Solving, Azure and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Communication, Node.js, C++, Kubernetes and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Leadership, Python, TensorFlow, Agile, C++, Teamwork and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in SQL, C++, AWS, Azure, Docker and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in JavaScript, Kubernetes, Python, C++, Angular and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Python, Problem Solving, C++, Node.js, Leadership, Java, JavaScript and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Kubernetes, Java, React, SQL, Python, Leadership and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in C++, React, Leadership, JavaScript and Angular. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, Kubernetes, Leadership, React and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T22:06:07.590135"
  }
]