[
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Problem Solving, C++ and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, TensorFlow, SQL, PyTorch, React, Leadership, Angular and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, SQL, React and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Agile, TensorFlow, PyTorch, Python, JavaScript and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Kubernetes, React, Agile, Problem Solving, Docker and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Docker, TensorFlow, Teamwork, Agile, C#, Node.js, Communication and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, React, C#, Azure, Problem Solving, AWS, Agile and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in TensorFlow, Java, Leadership, React, Azure, Communication, Kubernetes and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, AWS, Problem Solving, C++, PyTorch, Java and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, Problem Solving and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in PyTorch, Angular, Docker and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, Angular, Java, Problem Solving, Docker, AWS and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Problem Solving, AWS, C++, Java, Docker and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, Communication, Agile, Java, Teamwork, JavaScript, Python and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Data Solutions",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in SQL, C++, Communication, Python, Node.js, Kubernetes, Teamwork and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Angular, Python, SQL and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Docker, SQL, Angular, PyTorch, Communication, AWS, React and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in JavaScript, TensorFlow, Communication and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in Node.js, Agile, Problem Solving, TensorFlow and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data scientist with experience in C++, Azure, Agile and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in SQL, TensorFlow, React and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, Leadership, JavaScript, Docker, React and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in React, Teamwork, Communication, Node.js, TensorFlow and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Leadership, Agile, PyTorch, Node.js, Python, SQL, Teamwork and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, JavaScript and Teamwork. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C#, SQL, Azure, Angular and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C#, AWS, Teamwork, Problem Solving and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Leadership, SQL, Docker, C#, React, Azure, Java and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, React, Leadership and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Leadership, C++, Java, Teamwork, Azure and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "AI Research Labs",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in JavaScript, SQL, Kubernetes, Angular, Agile, Python and Java. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C++, SQL and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in C++, Leadership, Problem Solving, Python, PyTorch, Azure and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Java, JavaScript, TensorFlow, Kubernetes, PyTorch and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Azure, React, JavaScript and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Leadership, AWS, Angular and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in TensorFlow, Azure, Java, PyTorch, Kubernetes and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Communication, Angular, Node.js and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in AWS, Leadership, Azure, C#, Kubernetes, Python, Teamwork and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data scientist",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data scientist with experience in Angular, Docker, PyTorch and Agile. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data scientist",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Angular, JavaScript, Agile and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in SQL, JavaScript, AWS, Azure, Node.js and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Java, Python, Kubernetes, Node.js, React, Teamwork and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in C++, Communication, Teamwork and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Kubernetes, PyTorch and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Agile, AWS, Kubernetes, SQL, Python, Problem Solving and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "AI Research Labs",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Node.js, Angular, SQL, AWS and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Angular, Docker, Kubernetes, Teamwork and Leadership. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Docker, Teamwork and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Teamwork, Azure and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in React, C++, C#, Docker, Azure and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Problem Solving, Leadership, Agile, JavaScript, AWS, Python, SQL and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Problem Solving, PyTorch, AWS and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Azure, Node.js, Kubernetes, Java, Docker and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Communication, Node.js, Agile, AWS and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Python, Agile, Problem Solving, JavaScript, Docker and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Agile, Node.js, C++, JavaScript, AWS, Angular and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in React, Agile, JavaScript, Angular and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Leadership, Java and SQL. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "New York",
    "description": "We are looking for a data analyst with experience in Agile, TensorFlow, C++, JavaScript, Teamwork and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in New York and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in PyTorch, SQL, React, Leadership, Node.js, C++ and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, AWS and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Java, Python, Docker, React, Agile, C++ and Kubernetes. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Node.js, Teamwork, SQL, TensorFlow, Communication and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Python, Node.js and C++. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Cloud Systems",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, Teamwork, Communication, Agile, Azure, AWS, SQL and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Agile, Angular, Teamwork, Communication, C#, C++ and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in AWS, Azure, Angular, Communication and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Teamwork, Problem Solving, Kubernetes and TensorFlow. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Leadership, Angular, TensorFlow, Docker, Node.js, JavaScript, C++ and Communication. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in SQL, Teamwork, Communication, React, Java, Node.js and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Software Dynamics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, Teamwork, Leadership, Node.js, Problem Solving, React and AWS. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Kubernetes, PyTorch, Agile, TensorFlow and Problem Solving. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Digital Platforms",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Docker, Python, Kubernetes and JavaScript. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Java, Node.js, JavaScript, Communication, AWS, Kubernetes and React. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in C#, Problem Solving, TensorFlow, C++, Leadership, Angular and Azure. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Data Solutions",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in TensorFlow, Communication, AWS, Angular, SQL and Docker. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Smart Analytics",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Problem Solving, React and C#. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Tech Innovations",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in Java, AWS and PyTorch. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  },
  {
    "title": "data analyst",
    "company": "Future Technologies",
    "location": "Remote",
    "description": "We are looking for a data analyst with experience in AWS, Communication, JavaScript, Kubernetes, PyTorch, Problem Solving and Python. The ideal candidate will have strong technical skills and excellent communication abilities. This role is based in Remote and offers competitive compensation.",
    "source": "mock_data",
    "query": "data analyst",
    "scraped_at": "2025-04-17T08:34:40.167448"
  }
]